update entity diagram
